{
  "title": "Juggling Expectations",
  "created_datetime": 1488258000,
  "content": "*Explaining things in metaphors & a lesson learned*\n\n    Great teachers can explain anything in metaphors. It proves that the teacher is willing to bend their mind to present a concept in the audience’s native language. Wording metaphors the right way and conveying the message without losing it in the abstract explanation can be challenging. As a Scrum Master, I have been subjected to predicting the productivity of an Engineering team. How to strategize and sustain an increase in a Sprint velocity is something I found better explained through the forms of an allusion.\n\n    The Scrum Master and Product Owner (P.O.) must agree on the velocity of a Sprint to charge into the Sprint together as a cohesive, confident team. To accomplish this a Scrum Master needs to prove to the P.O. that the team is capable of not only meeting a velocity, but the number of stories in motion. My P.O. told me he wanted to increase our team’s velocity by 20% for the next Sprint even though we didn’t “hit the Sprint.” This was realistic to the P.O. from our ever-increasing productivity and more workdays available in the upcoming Sprint. With all factors at play, this perspective is wrong.\n\n    While the “velocity growth model” was logical, the course of action was too much too soon. Increasing a Sprint’s velocity too fast can be shocking to a Scrum team and hard to explain without the firsthand experience of an Engineer. Here’s where a metaphor allowed us to meet in the middle:\n\n![Juggling is all about managing workload.](/img/blog/juggling.jpeg “Juggling is all about managing workload.”)\nVia [Quanta Magazine](https://www.quantamagazine.org/20130509-model-behavior-the-mathematics-of-juggling/)\n\n>        Our goal is to juggle three balls. Launched from your fingers you start juggling them. You nod and your assistant tosses in a fourth ball; everything is going smoothly. A fifth ball is added to your act; it was a close call, but you were able to manage. The act comes to an end.\n\n>        The act begins again and your goal will be six balls. You last aimed for three, were capable of doing four, hardly handled five, and can extrapolate to achieve six. The outlook makes sense, but will you be comfortable taking it on? Let alone, do you have the confidence?\n\n    The juggling metaphor mended a rift in communication between myself and my P.O. and thus allowed him to understand how I felt about the subject of increasing workload drastically. When you are shooting to increase a Scrum team’s velocity shoot for meeting workload expectations and staying within your team’s comfort level. Scale slightly, not too much at once, and build morale with “delivering bonuses” (stories). You’ll get to a higher velocity faster. If you get caught up having to juggle significantly more balls than you’ve been comfortable with, this is at best a speculative recipe for success."
}
