{
  "title": "Why CEOs Should(n't) Code",
  "created_datetime": 1490245200,
  "content": "Several years ago a colleague of mine told me \"don't work somewhere where a CEO codes.\" The statement came without much justification and through my own experience I've been able to piece together why this a good and bad thing. It's not a \"polar sentiment,\" but interesting to analyze. There's a beauty and form of respect to it, while also a fear and unsettling feeling for an Engineering team. CEOs listen up, here’s what I have to say.\n\n## Gain the vision of what it's like to be an Engineer.\nDive into the doldroms, see what we are building, understand our pains, understand our process, get a better picture of the speed in which the product iterates, notice issues and understand what parts of the product need attention.\n\n## Avoid being totalitarian and overriding the Head of Product.\nThe Head of Product maintains the vision of the product - where it is going, keeping it uniform, and prioritizing what needs to get done today, this month, and this quarter. If the direction of the product is biased by the direction of the business, the vision of the product will flay.\nI've come to work on Monday to find new features embedded in the product built by the CEO at 3am on a weekend. This was the result of overriding the product team's decisions. The product has lost its uniformity over time and Engineers are stuck supporting code they know nothing about because CEOs seldom maintain code. **Keep the direction of the product a barometer, not a seismograph.** Slow shifts in product vision are okay, but avoid \"pendular snaps.\"\n\n![Product direction should change at the cadence of a barometer - slow.](/img/blog/barometer.jpg \"Product direction should change at the cadence of a barometer - slow.\")\n\n## It's motivating working with the top dog.\nEngineers love the attention of the CEO sitting with them, coding side-by-side. We've dealt enough with being nerds and treated differently than others and it feels great to not be the little guy anymore. How good does it feel when the CEO working next to you will defend you from other departments? No one can defend others from swooping in and raining fire on an outage or scope-creeping. Not happening when the CEO is around.\n\n![Taking control of the product](/img/blog/lego_ctrl_key.jpeg \"Taking control of the product\")\n\nThere is an elegant middle road to a CEO coding and if you work in a place where they know their limits, work well with the Engineers, and relate to their needs it can be an incredible experience. Beware \"product trump cards\" and software development that is misaligned to the status quo, the headaches will only build over time."
}
