{
  "title": "Postmature Promotions",
  "created_datetime": 1490850000,
  "content": "    Every company’s leadership team has aligned philosophies in management. The cadence for hiring & terminating employees, appropriate compensation, and career development are a short few that vary company to company. The \"postmature promotion\" is a philosophy to promote employees only after they are doing the job of the future title.\n\n    Say you join a company and over the course of a year new responsibilities trickle onto your plate from your manager. You’re in charge of a team, are given authority for pushback from other teams’ needs, and can delegate your work to your team members. With all the new responsibilities you juggle on a day-to-day basis you’re now doing the job of a role above you. Sure the work you do now is no longer tied to your title, but is that necessarily a bad thing? You betcha.\n\n![Striving For Your Career](/img/blog/running_with_suitcase.jpg \"Striving for your career\")\n\n    Doing the work of a title that is not yours increases the volatility of a promotion in your career path more than you may think. While it seems you are trending closer to that salary bump and title change, there can be some negative connotations to this position you are in...\n\n1. *If you lost your job you would have to start the climb all over again.*\n    Layoffs happen, you could lose your job for any reason. If you try looking for a new job are you going to be hired into the role you deserve, or the role you previously had? The latter is more likely, unless you can excel at selling your potential.\n\n2. *You are now doing more work that is not being reflected by further compensation.* Your company loves this situation because they can squeeze more work out of you without giving you anything in return. Be wary of burnout.\n\n3. *Promotions are not guaranteed.* Companies do not sell futures in promotions, they will only paint a picture where the potential is high. You might be doing the excess work for no reward.\n\n![Looking at the climb ahead](/img/blog/climbing_looking_up.jpeg \"Looking at the climb ahead\")\nThe furthest distance to travel is at the start.\n\n    Work for a company that shares the management philosophies you believe in. Never be afraid to ask for a title or compensation reflecting the work you are doing. The worst that can happen is that your request is postponed or denied; there is no implied risk. Be mindful of your workload & responsibilities and ensure to deliver the highest quality, but stay aligned with the title to your name."
}
