{
  "title": "Today Is Monday",
  "content": "## Inspired by the \"Body Ritual Among The Nacirema\" by Horace Miner\n\n    The day dates the twenty-sixth of January, well into another pass around the sun. Sixty others and myself all wake within the same hour to begin our trek. We dress ourselves in simple and comfortable clothing. There are no expectations of color or form, only simple coverings for our legs, torsos, and feet. We clench an aluminum box containing four pounds of tightly packed equipment to our chest as a newborn babe; it's the most important gear for the job. We call it our Koobcam. Aside from this box, some of us are donned in branded layers of clothes to keep our arms, head, and neck warm. Into our dystopian world we travel, fabricating what was never asked to be built, but will be proven to be imperative to everyone it touches.\n\n    Some of us trek hours, a fortunate few of us minutes. Reaching out of a hovering cloud of smog our limestone, silica tower rises. It is an arduous journey carrying the Koobcam to the job and we scale many vertical leaps to reach our destination. Pneumatic doors whoosh to the side as we enter. Individuals are scattering around the office, mirror reflections of us. Two of them nearly collide, a six-worded manuscript is exchanged in a mild manner. Again, another near collision! The same mannered manuscript is repeated. The activity begins to dull and we all corral ourselves to exposed pigeon holes.\n\n    With our Koobcam in front, all discussion ceases as we hinge open the aluminum box. The legacy of our predecessors lie in this box and how we find it dear to ourselves, for our legacy will soon be there too. We extract, expose, and analyze the tools that lay inside. Within these walls of grey we see what seems to be a seamless array of purpose categorized into flashing, inexplicable beauty of animated color and endless streams of information gathered from every point in our observable universe.\n\n    We pull together the millions of tools of distinct purpose to alchemize what our future generations will find relevant. Transformations are completed by combining, reshaping, and reforming what we already have in front of us. In a sense, the holistic work we do is meta - we build tools for others to build better tools, and so on and so forth. We enable others to communicate through different channels, be entertained by maniacal media, and find self-purpose in scribe. The image of our creation has not the words for which what we produce. We will toil until we define a finish line, then at which when reached we will be done with our work.",
  "created_datetime": 1485129600
}
