{
  "title": "There Are Always More Important Things",
  "created_datetime": 1490331600,
  "content": "Prioritization of work is something that is constantly being calibrated on a day-by-day basis for an Engineering team. \"Can you work on this today?\" or \"Drop what you’re doing, we should work on this now\" are not uncommon phrases in this line of work. That being said, there is a double-edged sword to the statement \"unless you have more important things to do.\"\n\nThere are *always* more important things to do. In the back of every Engineer’s head there are a list of priorities that need to get done that simply aren’t on paper - \"I need to fix that one area of code that’s gotten dirty over the last few months\" or \"We need to reduce that single point of failure with our database.\" In addition, there is always slated work that comes next. An Engineer always has an idea what they’re going to work on next.\n\nEngineers are focused artists painting in a gallery. A single work in progress will produce a shining piece of art but parallelized work results in distributed splendor. Every piece of code we write does not need to be a masterpiece, but should be foundational for other code to build off of. Art will have flaws during its development and an artist would always prefer fixing their mistakes before others add a coat of paint and accentuate those flaws. If I neared the end of my painting and a curator asked me to improve something unless I have other priorities, what would be my reaction? I’m an artist with great pride and if I have flawed works in progress I find it more important for me to correct my mistakes to make iterating on the painting easier.\n\n![Early flaws in painting](/img/blog/painting_flaws.jpg \"Early flaws in painting\")\nImage Via [Huffington Post](http://www.huffingtonpost.com/2013/06/30/painting-mistakes_n_3518178.html)\n\nDon’t tell an Engineer \"unless there are more important things to do.\" That can come off as a negative reverse sell, which does not work well with Engineers that do not want to make real-time prioritization decisions. Being clear with product priorities, courteous when approaching with work, and coupling this with effective communication is the right way to approach Engineers with work that needs to be done next."
}
